{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "f97fccfd",
   "metadata": {},
   "source": [
    "# Задание\n",
    "\n",
    "Написать код на Python в среде Jupyter Notebook для решения следующей задачи.\n",
    "\n",
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "\n",
    "Исходные данные имеют следующую структуру:\n",
    "\n",
    "```\n",
    "1. перечень всех документов\n",
    "documents = [\n",
    "{‘type’: ‘passport’, ‘number’: ‘2207 876234’, ‘name’: ‘Василий Гупкин’},\n",
    "{‘type’: ‘invoice’, ‘number’: ‘11-2’, ‘name’: ‘Геннадий Покемонов’},\n",
    "{‘type’: ‘insurance’, ‘number’: ‘10006’, ‘name’: ‘Аристарх Павлов’}\n",
    "]\n",
    "\n",
    "2. перечень полок, на которых хранятся документы (если документ есть в documents, он обязательно должен быть и в directories)\n",
    "directories = {\n",
    "‘1’: [‘2207 876234’, ‘11-2’],\n",
    "‘2’: [‘10006’],\n",
    "‘3’: []\n",
    "}\n",
    "```\n",
    "\n",
    "## Общие требования к программе:\n",
    "\n",
    "- код должен быть грамотно декомпозирован: каждая функция отвечает за свою конкретную задачу, дублирующиеся функции переиспользуются, а их код не повторяется;\n",
    "- в коде отсутствуют глобальные переменные, за исключением documents и directories;\n",
    "- пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу вводом команды q.\n",
    "\n",
    "## Задача 1\n",
    "\n",
    "Пользователь по команде p может узнать владельца документа по его номеру.\n",
    "\n",
    "Пример работы программы:\n",
    "\n",
    "```\n",
    "Введите команду:\n",
    "p\n",
    "\n",
    "Введите номер документа:\n",
    "10006\n",
    "\n",
    "Результат:\n",
    "Владелец документа: Аристарх Павлов\n",
    "```\n",
    "\n",
    "## Задача 2 (необязательная)\n",
    "\n",
    "Секретарь по команде s может по номеру документа узнать, на какой полке документ хранится.\n",
    "\n",
    "Пример работы программы:\n",
    "```\n",
    "Введите команду:\n",
    "s\n",
    "\n",
    "Введите номер документа:\n",
    "10006\n",
    "\n",
    "Результат:\n",
    "Документ хранится на полке: 2\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e6a5b1e7",
   "metadata": {},
   "outputs": [],
   "source": [
    "documents = [\n",
    "    {\"type\": \"passport\", \"number\": \"2207 876234\", \"name\": \"Василий Гупкин\"},\n",
    "    {\"type\": \"invoice\", \"number\": \"11-2\", \"name\": \"Геннадий Покемонов\"},\n",
    "    {\"type\": \"insurance\", \"number\": \"10006\", \"name\": \"Аристарх Павлов\"}\n",
    "]\n",
    "\n",
    "directories = {\n",
    "    \"1\": [\"2207 876234\", \"11-2\"],\n",
    "    \"2\": [\"10006\"],\n",
    "    \"3\": []\n",
    "}\n",
    "\n",
    "\n",
    "def print_owners(document_number):\n",
    "    global documents\n",
    "    response = [i[\"name\"] for i in documents if i[\"number\"] == document_number]\n",
    "    if len(response) == 0:\n",
    "        print(\"Ничего не найдено.\")\n",
    "    for item in response:\n",
    "        print(\"Владелец документа: {}\".format(item))\n",
    "    print()\n",
    "\n",
    "\n",
    "def print_directories(document_number):\n",
    "    global directories\n",
    "    response = [shelf for (shelf, doc_numbers) in directories.items() if document_number in doc_numbers]\n",
    "    if len(response) == 0:\n",
    "        print(\"Ничего не найдено.\")\n",
    "    for item in response:\n",
    "        print(\"Документ хранится на полке: {}\".format(item))\n",
    "    print()\n",
    "\n",
    "\n",
    "def get_document_number():\n",
    "    while True:\n",
    "        number = input(\"Введите номер документа:\")\n",
    "        print()\n",
    "        number = number.strip()\n",
    "        if number == \"\":\n",
    "            continue\n",
    "        return number\n",
    "\n",
    "\n",
    "def execute_command(symbol):\n",
    "    doc_number = get_document_number()\n",
    "    print(\"Результат:\")\n",
    "    if symbol == 'p':\n",
    "        print_owners(doc_number)\n",
    "    if symbol == 's':\n",
    "        print_directories(doc_number)\n",
    "\n",
    "\n",
    "def command():\n",
    "    symbol = input(\"Введите команду:\")\n",
    "    available_commands = [\"p\", \"s\", \"q\"]\n",
    "    \n",
    "    if symbol not in available_commands:\n",
    "        print('Команда не распознана. Доступны следующие команды:', ', '.join(available_commands))\n",
    "        return True\n",
    "    if symbol == \"q\":\n",
    "        return False\n",
    "    execute_command(symbol)\n",
    "\n",
    "\n",
    "def main():\n",
    "    while True:\n",
    "        is_exec = command()\n",
    "        if is_exec == False:\n",
    "            print('Выполнение программы остановлено.')\n",
    "            break\n",
    "\n",
    "\n",
    "main()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
