{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "58b70b12",
   "metadata": {},
   "source": [
    "# Описание задания\n",
    "\n",
    "Задание: написать программу, которая поможет пользователям определить, сколько денег они могут сэкономить на покупках в разных магазинах.\n",
    "\n",
    "## Условия:\n",
    "\n",
    "- Пользователь должен ввести список товаров, которые он собирается купить, и цены на эти товары в разных магазинах.\n",
    "- Затем программа должна вывести список магазинов и общую стоимость покупок в каждом магазине, а также сообщить, в каком магазине пользователь может сэкономить больше всего денег.\n",
    "- Список товаров и магазинов определяется самостоятельно.\n",
    "\n",
    "Выполненное задание разместите на GitHub."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "affe56c6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Молоко;Магазин 1;432.06;Магазин 2;82.63;Магазин 3;229.4\n",
      "Хлеб;Магазин 1;788.29;Магазин 2;45.39;Магазин 3;257.72\n",
      "Сметана;Магазин 1;250.6;Магазин 2;675.86;Магазин 3;242.41\n",
      "Вафли;Магазин 1;376.23;Магазин 2;18.03;Магазин 3;973.52\n",
      "Зефир глазированный;Магазин 1;431.21;Магазин 2;466.01;Магазин 3;638.85\n",
      "Сахар;Магазин 1;754.76;Магазин 2;979.68;Магазин 3;251.6\n",
      "Чипсы фермерские;Магазин 1;168.72;Магазин 2;600.5;Магазин 3;741.29\n"
     ]
    }
   ],
   "source": [
    "from typing import List\n",
    "import json\n",
    "import random\n",
    "\n",
    "def generate_list(products: List) -> List:\n",
    "    \"\"\"\n",
    "        Генерирует список цен в 3 магазинах\n",
    "    \"\"\"\n",
    "    stores = ['Магазин 1', 'Магазин 2', 'Магазин 3']\n",
    "    for product in products:\n",
    "        line = []\n",
    "        line.append(product)\n",
    "        for store in stores:\n",
    "            line.append(store)\n",
    "            line.append(str(random.randint(100, 100000)/100))\n",
    "        print(';'.join(line))\n",
    "\n",
    "        \n",
    "products = ['Молоко', 'Хлеб', 'Сметана', 'Вафли', 'Зефир глазированный', 'Сахар', 'Чипсы фермерские']\n",
    "generate_list(products)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "e947771e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Магазин 1\n",
      "-----------------------------\n",
      "             Молоко |  432.06\n",
      "               Хлеб |  788.29\n",
      "            Сметана |  250.60\n",
      "              Вафли |  376.23\n",
      "Зефир глазированный |  431.21\n",
      "              Сахар |  754.76\n",
      "   Чипсы фермерские |  168.72\n",
      "-----------------------------\n",
      "              Итого | 3201.87\n",
      "\n",
      "Магазин 2 (Лучшая цена)\n",
      "-----------------------------\n",
      "             Молоко |   82.63\n",
      "               Хлеб |   45.39\n",
      "            Сметана |  675.86\n",
      "              Вафли |   18.03\n",
      "Зефир глазированный |  466.01\n",
      "              Сахар |  979.68\n",
      "   Чипсы фермерские |  600.50\n",
      "-----------------------------\n",
      "              Итого | 2868.10\n",
      "\n",
      "Магазин 3\n",
      "-----------------------------\n",
      "             Молоко |  229.40\n",
      "               Хлеб |  257.72\n",
      "            Сметана |  242.41\n",
      "              Вафли |  973.52\n",
      "Зефир глазированный |  638.85\n",
      "              Сахар |  251.60\n",
      "   Чипсы фермерские |  741.29\n",
      "-----------------------------\n",
      "              Итого | 3334.79\n",
      "\n"
     ]
    }
   ],
   "source": [
    "input = '''Молоко;Магазин 1;432.06;Магазин 2;82.63;Магазин 3;229.4\n",
    "Хлеб;Магазин 1;788.29;Магазин 2;45.39;Магазин 3;257.72\n",
    "Сметана;Магазин 1;250.6;Магазин 2;675.86;Магазин 3;242.41\n",
    "Вафли;Магазин 1;376.23;Магазин 2;18.03;Магазин 3;973.52\n",
    "Зефир глазированный;Магазин 1;431.21;Магазин 2;466.01;Магазин 3;638.85\n",
    "Сахар;Магазин 1;754.76;Магазин 2;979.68;Магазин 3;251.6\n",
    "Чипсы фермерские;Магазин 1;168.72;Магазин 2;600.5;Магазин 3;741.29'''\n",
    "\n",
    "input = input.split(\"\\n\")\n",
    "data = {}\n",
    "\n",
    "# для красивого вывода\n",
    "max_len_of_product = 0\n",
    "\n",
    "# собираем данные по магазинам\n",
    "for line in input:\n",
    "    line = line.split(';')\n",
    "    product = line.pop(0)\n",
    "\n",
    "    # Вычисляем самое длинное название у продукта\n",
    "    if len(product) > max_len_of_product:\n",
    "        max_len_of_product = len(product)\n",
    "\n",
    "    for i in range(3):\n",
    "        store = line.pop(0)\n",
    "        price = float(line.pop(0))\n",
    "        if store not in data:\n",
    "            data[store] = {}\n",
    "        data[store][product] = price\n",
    "\n",
    "# Вычисляем дешёвый магазин\n",
    "result = None\n",
    "store_name = None\n",
    "for store in data:\n",
    "    summary = 0\n",
    "    for product in data[store]:\n",
    "        summary += data[store][product]\n",
    "    if result is None or summary < result:\n",
    "        result = summary\n",
    "        store_name = store\n",
    "        \n",
    "template = '{:>'+str(max_len_of_product)+'} | {:7.2f}'\n",
    "\n",
    "# Выводим результат\n",
    "for store in data:\n",
    "    summary = 0\n",
    "    print(store if store_name != store else '{} (Лучшая цена)'.format(store))\n",
    "    print('-'*(max_len_of_product + 10))\n",
    "    for product in data[store]:\n",
    "        price = data[store][product]\n",
    "        summary += price\n",
    "        ws_len = max_len_of_product - len(product)\n",
    "        print(template.format(product, price))\n",
    "    print('-'*(max_len_of_product + 10))\n",
    "    print(template.format('Итого', summary))\n",
    "    print()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
